china-djyos/djyos/bsp/cpudrv/stm32/h7/src/eth/cpu_peri_eth.c
    result = false;
    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;
    pDrive->debuginfo.sndTimes++;
    memset(Txbuffer, 0 , ETH_TX_DESC_CNT*sizeof(ETH_BufferTypeDef));
    if((NULL == handle)||(NULL == pkg))
        return result;

    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
        //copy datas to static frame buffer
        tmppkg = pkg;
        dst      = &gTxBuffer[0];
        do
        {
            src = (tmppkg->buf + tmppkg->offset);
            memcpy(dst,src,tmppkg->datalen);
            dst      += tmppkg->datalen;
            len      += tmppkg->datalen;
            if(PKG_ISLISTEND(tmppkg))
            {
                tmppkg = NULL;
                break;
            }
            else
            {
                tmppkg = tmppkg->partnext;
            }
        }while(NULL != tmppkg );

        if(len < EthTxBufSize)
        {
            src = &gTxBuffer[0];
            Txbuffer[0].buffer = src;
            Txbuffer[0].len = len;
            TxConfig.Length=len;
            TxConfig.TxBuffer=Txbuffer;
            SCB_CleanInvalidateDCache();    //无效化并清除Dcache
            //Prepare transmit descriptors to give to DMA
            if(HAL_OK == HAL_ETH_Transmit_IT(EthHandle,&TxConfig))
            {
                pDrive->debuginfo.sndOkTimes++;
                result = true;
            }
        }
        else
        {
            pDrive->debuginfo.sndPkgTooLongCnt++;
        }

        Lock_MutexPost(pDrive->protect);
    }

    return result;
}

u32 ETH_SendData(u8 *buf,u32 len)
{
    tagNetPkg          pkg;
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;

    pkg.partnext = NULL;
    pkg.pkgflag  = (1<<0);  //只有一个包
    pkg.offset   = 0;
    pkg.datalen  = len;
    pkg.buf      = buf;
    if(MacSnd(pDrive->devhandle,&pkg,len,0))
    {
        return len;
    }
    else
    {
        return 0;
    }
}
//This is the interrut handler
u32 ETH_IntHandler(ufast_t IntLine)
{
    tagMacDriver *pDrive;
    ETH_HandleTypeDef *EthHandle;

    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;

    pDrive->debuginfo.Ints++;
    /* Packet received */
    if (__HAL_ETH_DMA_GET_IT(EthHandle, ETH_DMACSR_RI) && __HAL_ETH_DMA_GET_IT_SOURCE(EthHandle, ETH_DMACIER_RIE))
    {
      /* Call this function to update handle fields */
      HAL_ETH_IsRxDataAvailable(EthHandle);

      /* Receive complete callback */
      pDrive->debuginfo.rcvInts++;
      Lock_SempPost(pDrive->rcvsync);

      /* Clear the Eth DMA Rx IT pending bits */
      __HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMACSR_RI | ETH_DMACSR_NIS);
    }

    /* Packet transmitted */
    if (__HAL_ETH_DMA_GET_IT(EthHandle, ETH_DMACSR_TI) && __HAL_ETH_DMA_GET_IT_SOURCE(EthHandle, ETH_DMACIER_TIE))
    {
      /* Transfer complete callback */
//      HAL_ETH_TxCpltCallback(EthHandle);

      /* Clear the Eth DMA Tx IT pending bits */
      __HAL_ETH_DMA_CLEAR_IT(EthHandle, ETH_DMACSR_TI | ETH_DMACSR_NIS);

      EthHandle->ErrorCode = HAL_ETH_ERROR_NONE;
      EthHandle->gState = HAL_ETH_STATE_READY;
    }


    /* ETH DMA Error */
    if(__HAL_ETH_DMA_GET_IT(EthHandle, ETH_DMACSR_AIS) && __HAL_ETH_DMA_GET_IT_SOURCE(EthHandle, ETH_DMACIER_AIE))
    {
      EthHandle->ErrorCode |= HAL_ETH_ERROR_DMA;

      /* if fatal bus error occured */
      if (__HAL_ETH_DMA_GET_IT(EthHandle, ETH_DMACSR_FBE) && __HAL_ETH_DMA_GET_IT_SOURCE(EthHandle, ETH_DMACIER_FBEE))
      {
        /* Get DMA error code  */
        EthHandle->DMAErrorCode = __HAL_ETH_DMA_GET_IT(EthHandle, (ETH_DMACSR_FBE | ETH_DMACSR_TPS | ETH_DMACSR_RPS));

        /* Disable all interrupts */
        __HAL_ETH_DMA_DISABLE_IT(EthHandle, ETH_DMACIER_NIE | ETH_DMACIER_AIE);

        /* Set HAL state to ERROR */
        EthHandle->gState = HAL_ETH_STATE_ERROR;
      }
      else
      {
        /* Get DMA error status  */
        EthHandle->DMAErrorCode = __HAL_ETH_DMA_GET_IT(EthHandle, (ETH_DMACSR_CDE | ETH_DMACSR_ETI | ETH_DMACSR_RWT |
                                                         ETH_DMACSR_RBU | ETH_DMACSR_AIS));

        /* Clear the interrupt summary flag */
        __HAL_ETH_DMA_CLEAR_IT(EthHandle, (ETH_DMACSR_CDE | ETH_DMACSR_ETI | ETH_DMACSR_RWT |
                                      ETH_DMACSR_RBU | ETH_DMACSR_AIS));
      }

      /* Ethernet Error callback */
      HAL_ETH_DMAErrorCallback(EthHandle);
    }

    /* ETH MAC Error IT */
    if(__HAL_ETH_MAC_GET_IT(EthHandle, (ETH_MACIER_RXSTSIE | ETH_MACIER_TXSTSIE)))
    {
      /* Get MAC Rx Tx status and clear Status register pending bit */
      EthHandle->MACErrorCode = READ_REG(EthHandle->Instance->MACRXTXSR);

      EthHandle->gState = HAL_ETH_STATE_ERROR;

      /* Ethernet PMT callback */
      HAL_ETH_MACErrorCallback(EthHandle);

      EthHandle->MACErrorCode = (uint32_t)(0x0U);
    }

    /* ETH PMT IT */
    if(__HAL_ETH_MAC_GET_IT(EthHandle, ETH_MAC_PMT_IT))
    {
      /* Get MAC Wake-up source and clear the status register pending bit */
        EthHandle->MACWakeUpEvent = READ_BIT(EthHandle->Instance->MACPCSR, (ETH_MACPCSR_RWKPRCVD | ETH_MACPCSR_MGKPRCVD));

      /* Ethernet PMT callback */
      HAL_ETH_PMTCallback(EthHandle);

      EthHandle->MACWakeUpEvent = (uint32_t)(0x0U);
    }

    /* ETH EEE IT */
    if(__HAL_ETH_MAC_GET_IT(EthHandle, ETH_MAC_LPI_IT))
    {
      /* Get MAC LPI interrupt source and clear the status register pending bit */
        EthHandle->MACLPIEvent = READ_BIT(EthHandle->Instance->MACPCSR, 0x0000000FU);

      /* Ethernet EEE callback */
      HAL_ETH_EEECallback(EthHandle);

      EthHandle->MACLPIEvent = (uint32_t)(0x0U);
    }

    /* check ETH WAKEUP exti flag */
    if(__HAL_ETH_WAKEUP_EXTI_GET_FLAG(ETH_WAKEUP_EXTI_LINE) != RESET)
    {
      /* Clear ETH WAKEUP Exti pending bit */
      __HAL_ETH_WAKEUP_EXTI_CLEAR_FLAG(ETH_WAKEUP_EXTI_LINE);
      /* ETH WAKEUP interrupt user callback */
      HAL_ETH_WakeUpCallback(EthHandle);
    }
    return 0;
}
//mac control function
#define EN_NETDEV_ADDRFILTER (EN_NETDEV_CMDLAST + 1)
static bool_t MacCtrl(void *devhandle,u8 cmd,ptu32_t para)
{
    bool_t result = false;
    tagMacDriver   *pDrive;
    pDrive = &gMacDriver;
    if((pDrive->devhandle == devhandle)&&\
        (Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER)))
    {
        switch(cmd)
        {
            case EN_NETDEV_SETNOPKG:
                if(para)
                {
                    ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                }
                result = true;
                break;
            case EN_NETDEV_SETBORAD:
                if(para)
                {
//                    __macbitsclear(&pDrive->EthHandle->Instance->MACFFR,ETH_MACFFR_BFD);
                    printk("mac broad enable\n\r");
                    pDrive->macstat.bfd = 0;
                }
                else
                {
//                    __macbitsset(&pDrive->EthHandle->Instance->MACFFR,ETH_MACFFR_BFD);
                    printk("mac broad disable\n\r");
                    pDrive->macstat.bfd = 1;
                }
                result = true;
                break;
            case EN_NETDEV_SETPOINT:
                if(para)
                {
//                    __macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
//                            ETH_MACFFR_HU);//绝对单播模式
                }
                else
                {
//                    __macbitsset(&pDrive->EthHandle->Instance->MACFFR,
//                            ETH_MACFFR_HU);//散列单播模式
                }
                result = true;
                break;
            case EN_NETDEV_SETMULTI:
                if(para)
                {
//                   __macbitsset(&pDrive->EthHandle->Instance->MACFFR,
//                           ETH_MACFFR_PAM);//pass all multicast
                }
                else
                {
//                    __macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
//                            ETH_MACFFR_PAM);//multicast filt
                }
               result = true;
                break;
            case EN_NETDEV_SETRECV:
                if(para)
                {
//                    HAL_ETH_StartReceive(pDrive->EthHandle);
                }
                else
                {
//                    HAL_ETH_StopReceive(pDrive->EthHandle);
                }
                result = true;
                break;
            case EN_NETDEV_SETSEND:
                if(para)
                {
//                    HAL_ETH_StartTransmit(pDrive->EthHandle);
                }
                else
                {
//                    HAL_ETH_StopTransmit(pDrive->EthHandle);
                }
                break;
            case EN_NETDEV_SETMAC:
                memcpy(pDrive->macaddr,(u8 *)para, CN_MACADDR_LEN);
                ETH_HardDrvInit(pDrive);
                pDrive->debuginfo.rsttimes++;
                result = true;
                break;
            case EN_NETDEV_SETMULTIMAC:
                break;
            case EN_NETDEV_GTETMAC:
                if((u8 *)para != NULL)
                {
                    memcpy((u8 *)para,pDrive->macaddr, CN_MACADDR_LEN);
                    result = true;
                }
                break;
            case EN_NETDEV_RESET:
                if(para)
                {
                    ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                    result = true;
                }
                break;
            case (EN_NETDEV_ADDRFILTER):    //增加一条是否接收所有包
                if(para)
                {
//                    __macbitsclear(&pDrive->EthHandle->Instance->MACFFR,
//                            ETH_MACFFR_RA);//addr filter
                }
                else
                {
//                    __macbitsset(&pDrive->EthHandle->Instance->MACFFR,
//                                               ETH_MACFFR_RA);//pass all pkg
                }
                break;
            default:
                result = false;
                break;
        }
        Lock_MutexPost(pDrive->protect);
    }

    return result;
}

//this is the receive task
static ptu32_t __MacRcvTask(void)
{
    tagNetPkg *pkg=NULL;
    void      *handle;
    u8        *rawbuf;
    u16        len;
    tagMacDriver      *pDrive;
    pDrive = &gMacDriver;



