china-djyos/djyos/bsp/cpudrv/stm32/h7/src/eth/cpu_peri_eth.c
u8 GMAC_MdioR(u8 dev,u8 reg, u16 *value)
{
    u32 rValue;
    tagMacDriver   *pDrive = &gMacDriver;
    if(pDrive->EthHandle==NULL)
        return 0;
    if(HAL_OK != HAL_ETH_ReadPHYRegister(pDrive->EthHandle,dev,reg,&rValue))
        return 0;
    *value = (u16)rValue;
    return 1;
}
u8 GMAC_MdioW(u8 dev,u8 reg, u16 value)
{
    tagMacDriver   *pDrive = &gMacDriver;
    if(pDrive->EthHandle==NULL)
        return 0;
    if(HAL_OK != HAL_ETH_WritePHYRegister(pDrive->EthHandle,dev,reg,value))
        return 0;
    return 1;
}
extern void GMAC_InLowPowerPinCfg(void);
extern void GMAC_OutLowPowerPinCfg(void);

// =============================================================================
// 功能： 进入或退出低功耗模式
//     时钟使能 控制器使能 GPIO设置相应的状态
// 参数： port 串口号：如 CN_UART1
//     flag 进入低功耗 或退出低功耗标志：如 UART_IN_LOWPOWER
// 返回：true/false
// =============================================================================
bool_t GMAC_LowPowerConfig(u8 flag)
{
    if(flag == InLowPower)
    {
        RCC->AHB1ENR&=~(1<<25);  //禁能ETHMAC时钟
        GMAC_InLowPowerPinCfg();
        return true;
    }
    else if (flag == OutLowPower)
    {
         RCC->AHB1ENR|=1<<25;  //使能ETHMAC时钟
         GMAC_OutLowPowerPinCfg();
         MacReset(0);
        return true;
    }
    else
        return false;
}
ADD_TO_ROUTINE_SHELL(macfiltdis,macfiltdis,"usage:MacAddrDis, receive all frame(don't care MAC filter)");
ADD_TO_ROUTINE_SHELL(macfilten,macfilten,"usage:MacAddrEn, don't receive all frame(MAC filter)");
ADD_TO_ROUTINE_SHELL(macsnden,macsnden,"usage:MacSndEn");
ADD_TO_ROUTINE_SHELL(macsnddis,macsnddis,"usage:MacSndDis");
ADD_TO_ROUTINE_SHELL(macreset,macreset,"usage:reset gmac");
ADD_TO_ROUTINE_SHELL(macreg,macreg,"usage:MacReg");
ADD_TO_ROUTINE_SHELL(mac,mac,"usage:gmac");
